simulation/openFoam/0/p

    FoamFile
    {
        version     2.0;
        format      ascii;
        class       volScalarField;
        location    "0";
        object      p_rgh;
    }

    dimensions      [0 2 -2 0 0 0 0];
    internalField   uniform 0;

    boundaryField
    {
        allBoundary
        {
            type            zeroGradient;
        }
        walls
        {
            type            zeroGradient;
        }
        inlet
        {
            type            zeroGradient;
        }

        outlet
        {
            type            fixedValue;
            value           uniform 0;
        }
    }
    