simulation/openFoam/constant/transportProperties

    FoamFile
    {
        version     2.0;
        format      ascii;
        class       dictionary;
        location    "constant";
        object      transportProperties;
    }

    transportModel  Newtonian;
    nu              [ 0 2 -1 0 0 0 0 ] 1e-06; // maybe change to: nu [0 2 -1 0 0 0 0] 9.327983951855567e-7;
    