simulation/openFoam/constant/turbulenceProperties

  FoamFile
  {
    version 2.0;
    format ascii;
    class dictionary;
    location "constant";
    object momentumTransport;
  }

    simulationType laminar;

    RAS
    {
      RASModel laminar;
      turbulence off;
      printCoeffs off;
    }
