simulation/openFoam/system/blockMeshDict

    FoamFile
    {
        format      ascii;
        class       dictionary;
        object      blockMeshDict;
    }

    convertToMeters 1.0;

    vertices 
    (
        ( 0.0  0.0  0.0)
        ( 0.03  0.0  0.0)
        ( 0.03  0.015  0.0)
        ( 0.0  0.015  0.0)
        ( 0.0  0.0  0.0008)
        ( 0.03  0.0  0.0008)
        ( 0.03  0.015  0.0008)
        ( 0.0  0.015  0.0008)
    );

    blocks
    (
        hex (0 1 2 3 4 5 6 7) (100 150 20) simpleGrading (1 1 1)
    );

    edges (
    );

    boundary (
        allBoundary
        {
            type wall;
            faces
            (
                (0 1 5 4)
                (4 5 6 7)
                (7 6 2 3)
                (1 0 3 2)
                (1 5 6 2)
                (0 3 7 4)
            );
        }
    );
    