simulation/openFoam/system/checkMeshSpheroid.txt
checkMesh
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
Build  : 12-8b1612fe08a0
Exec   : checkMesh
Date   : Sep 09 2024
Time   : 15:10:53
Host   : "openfoam"
PID    : 49848
I/O    : uncollated
Case   : /Users/maria/MultipassShared/openFoamSimulation
nProcs : 1
sigFpe : Floating point exception trapping - not supported on this platform
fileModificationChecking : Monitoring run-time modified files using timeStampMaster (fileModificationSkew 10)
allowSystemOperations : Allowing user-supplied system call operations

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
Create time

Create polyMesh for time = 0

Time = 0s

Mesh stats
    points:           671987
    faces:            1593298
    internal faces:   1371031
    cells:            463570
    faces per cell:   6.39457
    boundary patches: 3
    point zones:      0
    face zones:       0
    cell zones:       0

Overall number of cells of each type:
    hexahedra:     365640
    prisms:        24270
    wedges:        0
    pyramids:      0
    tet wedges:    59
    tetrahedra:    0
    polyhedra:     73601
    Breakdown of polyhedra by number of faces:
        faces   number of cells
            4   166
            5   1199
            6   11442
            7   878
            8   162
            9   51137
           10   2
           12   7821
           15   749
           18   45

Checking topology...
    Boundary definition OK.
    Cell to face addressing OK.
    Point usage OK.
    Upper triangular ordering OK.
    Face vertices OK.
    Number of regions: 1 (OK).

Checking patch topology for multiply connected surfaces...
                   Patch    Faces   Points                  Surface topology
                   walls   217404   223292  ok (non-closed singly connected)
                   inlet     2145     2363  ok (non-closed singly connected)
                  outlet     2718     3025  ok (non-closed singly connected)

Checking geometry...
    Overall domain bounding box (0.00391575 0.00364744 -1.33415e-06) (0.0259184 0.011353 0.000801091)
    Mesh has 3 geometric (non-empty/wedge) directions (1 1 1)
    Mesh has 3 solution (non-empty) directions (1 1 1)
    Max cell openness = 4.16786e-16 OK.
    Max aspect ratio = 23.2731 OK.
    Minimum face area = 1.17e-11. Maximum face area = 3.51306e-08.  Face area magnitudes OK.
    Min volume = 2.65675e-16. Max volume = 1.41531e-12.  Total volume = 2.56888e-08.  Cell volumes OK.
    Mesh non-orthogonality Max: 77.6828 average: 16.6922
   *Number of severely non-orthogonal (> 70 degrees) faces: 830.
    Non-orthogonality check OK.
    Face pyramids OK.
 ***Max skewness = 6.76084, 674 highly skew faces detected which may impair the quality of the results
    Coupled point location match (average 0) OK.

Failed 1 mesh checks.

End
